import React from 'react';
import html2canvas from 'html2canvas';
import jsPDF from 'jspdf';
import './style.css'



const ContractDocument = () => {

    const downloadPdf = async () => {
        const input = document.getElementById('contract-content');
        const canvas = await html2canvas(input);
        const imgData = canvas.toDataURL('image/png');
        const pdf = new jsPDF('p', 'mm', 'a4');
        const imgProps = pdf.getImageProperties(imgData);
        const pdfWidth = pdf.internal.pageSize.getWidth();
        const pdfHeight = (imgProps.height * pdfWidth) / imgProps.width;
        pdf.addImage(imgData, 'PNG', 0, 0, pdfWidth, pdfHeight);
        pdf.save('contract.pdf');
    };

    const data2 = {
        "lotissement": "\r\n HC6 المقسم\r\nILOT HC6",
        "blocLog": "Bloc 6.A",
        "niveauLog": "الطابق الأرضي \r\nR-D-C\r\n",
        "numeroLog": "6.A.0.1",
        "typeLog": "S+1",
        "superficieLog": 62.642999999999994,
        "numClient": 442,
        "nomPrenomArClient": "فائزة بنت محمد المالكي الكرتلي ",
        "cinClient": "02735960",
        "revenuFamilialClient": 150,
        "categorieClient": "1",
        "delegation": "الكبارية",
        "dateNClient": "10/01/1968",
        "nomPrenonConjoint": "",
        "cinConjoint": "",

        "ta":{
            "durreeTotale": 300,
            "montantAvance": 0,
            "montantTotal": 30000,
            "montantRestant": null,
            "tauxInteret": 10,
            "status": "ENCOURS",
            "type": "PERIODE_FIX_5ANS",
            "dateDebut": "2024-09-01T00:00:00.000+00:00",
        }
       
    };

    const data = {
        //fixed
        
        //a faire ou refaire ou ajuster ou fixer
        numCompteSnit:'17000000000001398003',
        residence: 'نيابوليس',
        ville: 'المرازقة',
        governorat: 'نابل',
        dateCin: '25/01/2024',
        dateCinConjoint: '25/02/2024',
        lieuNaissance: 'الكبارية',
        mantant:'30.000.000',
        mantantEnLettre:'ثلاثون ألف دينارا و صفر مليماً',


        //peut etre dynamique
        num_dessin_immobileir: "548340 ",
        durreeTotaleEnLettre:'خمسة وعشرون سنة',
        dureePeriode:'خمس سنوات',


        //a communiquer
        lotissement: 'HC31',
        




    };




    const isFEMME = data2.nomPrenomArClient.includes(' بنت ');
    const adjustedText = {
        subject: isFEMME ? 'السيدة' : 'السيد',
        locataire: isFEMME ? 'المتسوغة' : 'المتسوغ',
        adresse: isFEMME ? 'بعنوانها' : 'بعنوانه',
    };

    return (
        <div dir='rtl' id="contract-content" >
            <div className='contrat'>
                <div className="title">
                    <h1> عقد كراء مملك</h1>
                </div>
                <div className="section bold">

                    <p >
                        بيــن الممضيين أسفــــــــله:
                        <br />
                        الشركة الوطنية العقارية للبلاد التونسية ، منشأة عمومية محدثة بمقتضى القانون عدد 19 لسنة 1957 المؤرخ في 10 سبتمبر 1957 و المنقح بالقانون عدد 9 لسنة 1989 و المؤرخ في 01 فيفري 1989 ومسجلة بالسجل الوطني للمؤسسات C19851997 الترقيم الجبائي RBM000/2806 ومرخص لها في مباشرة نشاط البعث العقاري بموجب القرار الصادر عن السيد وزير التجهيز والإسكان بتاريخ 19 مارس 2014 والكائن مقرها الاجتماعي بحي المنار الثاني بتونس 2092 ويمثلها في هذا العقد رئيسها مديرها العام السيد فهمي كمون بمقتضى التفويض الصادر له عن مجلس إدارة الشركة بتاريخ 24 ديسمبر 2021 ، طبقا لمحضر الجلسة عدد 04/2021 والمسجل بالقباضة المالية بالمنزه التاسع تونس بتاريخ 30 ديسمبر 2021 تحت وصل عدد M086441 تسجيل عدد 21804563 .

                        <span >
                            من جـــهة (بصفتها المسوغة)،
                        </span>

                    </p>
                </div>

                <div className="section">

                    <p>
                        والسيد
                        <span className='data'>{' ' + data2.nomPrenomArClient + ' '}</span>
                        ، تونسي الجنسية وصاحب بطاقة التعريف الوطنية عدد
                        <span className='data'>{' ' + data2.cinClient + ' '}</span>
                        الصادرة بتونس في
                        <span className='data'>{' ' + data.dateCin + ' '}</span>
                        والمولود في
                        <span className='data'>{' ' + data.lieuNaissance + ' '}</span>
                        بتاريخ
                        <span className='data'>{' ' + data2.dateNClient + ' '}</span>
                        ، والقاطن بنهج
                        <span className='data'>{' ' + data2.delegation + ' '}</span>
                        ، والمتزوج بالسيدة
                        <span className='data'>{' ' + data2.nomPrenonConjoint + ' '}</span>
                        حسب نظام
                        <span className='colored'> الاشتراك في الأملاك،</span>
                        صاحبة بطاقة التعريف الوطنية عدد
                        <span className='data'>{' ' + data2.cinConjoint + ' '}</span>
                        الصادرة بتونس في
                        <span className='data'>{' ' + data.dateCinConjoint + ' '}</span>
                        ، والذي اختار محل مخابرته بالمسكن موضوع هذا العقد والمشار إليه فيما يلي بعبارة "المتسوغ".

                        <span className='bold'>
                            من جـــهة أخرى(بصفته المتسوغ)،
                        </span>

                    </p>
                </div>

                <div className="title">
                    <h1> توطئـــــة </h1>
                </div>

                <div className="section">
                    <p>
                        بعـــد الاطلاع على القانون عدد 1 لسنة 2012 المؤرخ في 16/5/2012 المتعلق بقانون المالية التكميلي لسنة 2012 كما تم تنقيحه بالمرسوم عدد 21 لسنة 2021 المؤرخ في 28 ديسمبر 2021 المتعلق بقانون المالية لسنة 2022 والمتضمن في فصوله من 27 إلى 31 إحداث برنامج خصوصي للسكن الاجتماعي لفائدة الفئات الاجتماعية محدودة الدخل.
                        وعلى القانون عدد 51 لسنة 2013 المؤرخ في 23 ديسمبر 2013 المتعلق بقانون المالية التكميلي لسنة 2013،
                        وعلى القانون عدد 53 لسنة 2015 المؤرخ في 25 ديسمبر 2015 المتعلق بقانون المالية لسنة 2016 وخاصة الفصلين  11 و12 منه،

                    </p>
                </div>

                <div className="section">


                    <p>
                        وعلى الأمر عدد 1224 لسنة 2012 المؤرخ في 10 أوت 2012 المتعلق بتطبيق أحكام قانون المالية التكميلي لسنة 2012 المتعلقة بإحداث البرنامج الخصوصي للسكن الاجتماعي وعلى جميع النصوص المنقحة والمتممة له كالأمر الرئاسي عدد 538 لسنة 2023 المؤرخ في
                        <span className='colored'>                        20 جويلية 2023.
                        </span>
                        وعلى قرار وزير التجهيز والإسكان والتهيئة الترابية ووزير المالية المؤرخ في 31 مارس 2016 المتعلق بضبط صيغ وشروط وإجراءات استكمال تمويل ثمن المساكن والمقاسم الاجتماعية المسندة في إطار البرنامج الخصوصي للسكن الاجتماعي،


                    </p>
                </div>
                <div className="section">
                    <p>



                        وعلى اتفاقية التفويض المبرمة بين وزارة التجهيز والبيئة والشركة الوطنية العقارية للبلاد التونسية
                        <span className='colored'>{' '}
                            المسجلة بالقباضة المالية بسيدي حسين تونس
                            {' '}
                        </span>

                        بتاريخ 24 جويلية 2012 تسجيل عدد 12401889 وصل عدد M020025 والتي تم بمقتضاها تكليف الشركة الوطنية العقارية للبلاد التونسية بإنجاز دراسات المجمع السكني بمدينة عمر المختار بمنطقة سيدي حسين السيجومي تونس على المقسم

                        <span className='colored'>{data.lotissement}</span> من الصنف الاجتماعي موضوع الرسم العقاري عدد
                        <span className='colored'>{' ' + data.num_dessin_immobileir + ' '} </span>
                        نابل،
                    </p>
                </div>


                <div className="section">
                    <p>
                        وعلى اتفاقية التفويض المبرمة بين وزارة التجهيز والبيئة والشركة الوطنية العقارية للبلاد التونسية المسجلة بالقباضة المالية بسيدي حسين تونس بتاريخ 24 جويلية 2012 تسجيل عدد 12401889 وصل عدد M020025 والتي تم بمقتضاها تكليف الشركة الوطنية العقارية للبلاد التونسية بإنجاز دراسات المجمع السكني بمدينة عمر المختار بمنطقة سيدي حسين السيجومي تونس على المقسم
                        <span className='data'>{' ' + data.lotissement + ' '}</span>
                        من الصنف الاجتماعي موضوع الرسم العقاري عدد
                        548340
                        نابل،
                    </p>
                </div>

                <div className="section">
                    <p>
                        وعلى ملحق عدد 01 لاتفاقية تفويض وتمويل إنجاز أشغال المجمع السكني "بمدينة عمر المختار" بمنطقة سيدي حسين السيجومي تونس المبرم بين وزارة التجهيز والإسكان والتهيئة الترابية والشركة الوطنية العقارية للبلاد التونسية والمسجل بالقباضة المالية بسيدي حسين تونس بتاريخ 13 ديسمبر 2019 تحت وصل عدد M06765 ، تسجيل عدد 19403868.
                    </p>
                </div>

                <div className="section">
                    <p>
                        وعلى ملحق عدد 02 لاتفاقية تفويض وتمويل إنجاز مجمع سكني "بمدينة عمر المختار" بمنطقة سيدي حسين السيجومي تونس المبرم بين وزارة التجهيز والإسكان والتهيئة الترابية والشركة الوطنية العقارية للبلاد التونسية والمسجل بالقباضة المالية بالمنزه السادس بتاريخ 07 ديسمبر 2016 تحت عدد 15405646، الوصل عدد M107977.
                        وعلى مصادقة لجنة قيادة برنامج السكن الاجتماعي على أنموذج عقد الكراء المملك بتاريخ 2 ديسمبر 2015،
                        وعلى مصادقة لجنة قيادة برنامج السكن الاجتماعي على أنموذج عقد الكراء المملك بتاريخ 30 ماي 2023،
                        وعلى قائمة المنتفعين بهذه الشقق المصادق عليها من قبل اللجنة الجهوية لمتابعة برنامج السكن الاجتماعي بولاية تونس بتاريخ
                        <span className='colored'>20 جويلية 2023.</span>

                    </p>
                </div>
                <div className="title">
                    <h1> تم الاتفاق والتراضي على ما يلي:   </h1>
                </div>

                <div className="section">
                    <h2>الفصل الأول: موضوع العقد. </h2>

                    <p>
                        سوّغت على وجه الكراء المملك الشركة الوطنية العقارية للبلاد التونسية ، بصفتها المسوغة، تحت جميع الضمانات القانونية والفعلية السيد
                        <span className='data'>{' ' + data2.nomPrenomArClient + ' '}</span>
                        بصفته المتسوغ، الشقة عدد
                        <span className='data' dir='ltr'>{' ' + data2.numeroLog + ' '}</span>
                        من العمارة
                        <span className='data' dir='ltr'>{' ' + data2.blocLog + ' '}</span>
                        بالطابق
                        <span className='data' dir='ltr'>{' ' + data2.niveauLog + ' '}</span>
                        بإقامة
                        " 
                        <span className='data' dir='ltr'>{' ' + data.residence + ' '}</span>
                        "
                        بمنطقة المرازقة بنابل مقسم
                        <span className='data'>{' '+data.lotissement+' '}</span>
                        " صنف اجتماعي " تتكون من عدد
                        <span className='data'>{' 0'+data2.typeLog.charAt(data2.typeLog.length - 1)+' '}</span>
                        غرف وقاعة استقبال ومطبخ وبيت استحمام تبلغ مساحتها الجملية
                        <span className='data'>{' '+data2.superficieLog.toFixed(2)+' '}</span>
                         م2 تقريبا باعتبار الأجزاء المشتركة التي ستستخرج تبعا لمثال التقسيم النهائي من الرسم العقاري عدد 
                         38013/110265 تونس.

                    </p>
                </div>

                <div className="section">
                    <h2>
                        الفصل الثاني: انجرار الملكية.
                    </h2>
                    <p>
                        انجرت ملكية العقار موضوع الرسم العقاري عدد 38013/110265 تونس لفائدة الشركة الوطنية العقارية للبلاد التونسية بموجب عقد البيع المبرم بينها وبين السيد وزير أملاك الدولة والشؤون العقارية القائم في حق ملك الدولة الخاص والمسجل بالقباضة المالية بسيدي حسين السيجومي تونس بتاريخ 06 ماي 2013 تحت وصل عدد M020272، تسجيل عدد 13101355.
                    </p>
                </div>

                <div className="section">
                    <h2>
                        الفصل الثالث: ثمن التفويت.
                    </h2>
                    <p>
                        تم تحديد ثمن التفويت بمبلغ جملي ونهائي قدره :
                        <span className='data'>{' '+data.mantantEnLettre+' '}</span>

                         (
                            <span className='data' dir='ltr'>{' ' + data2.montantTotal + ' '}</span>
                         د) يضاف إليه نسبة 
                        
                        <span className='data' dir='ltr'>{' ' + data2.tauxInteret + '% '}</span>
                         كل 
                         
                         <span className='data' >{' '+data.dureePeriode+' '}</span>
                          تطبيقا للفصل 2 من قرار وزير التجهيز والإسكان والتهيئة الترابية ووزير المالية المؤرخ في 31 مارس 2016 وذلك طبقا لجدول احتساب الأقساط المصاحب لهذا العقد الذي قبله المتسوغ والذي يعتبر جزءا لا يتجزأ من هذا العقد.
                    </p>
                </div>

                <div className="section">
                    <h2>
                        الفصل الرابع: طريقة خلاص ثمن التفويت.                    </h2>
                    <p>
                        يتم خلاص الثمن الجملي للشقة موضوع هذا العقد عن طريق الكراء المملك وذلك على أساس معينات كراء تدفع من قبل المتسوغ بالحساب البريدي الجاري للشركة الوطنية العقارية للبلاد التونسية عدد 
                        <span className='data' dir='ltr'>{' '+data.numCompteSnit+' '}</span>

                        
                         وذلك بداية كل شهر وطيلة مدة 
                        <span className='data' >{' ' + data.durreeTotaleEnLettre + ' '}</span>
                        (
                            <span className='data' dir='ltr'>{' ' + Math.floor(data2.durreeTotale/12) + ' '}</span>
                             سنة)
                         طبقا للفصل 2 من قرار وزير التجهيز والإسكان والتهيئة الترابية ووزير المالية مؤرخ في 31 مارس 2016 بداية من تاريخ التسليم وذلك طبقا لجدول احتساب الخلاص المقابل لهذا العقد ومقابل وصولات خلاص تسلم شهريا في الغرض من قبل الشركة الوطنية العقارية للبلاد التونسية
                        حرصا على ضمان استرجاع الدين المتخلّد بذمته لفائدة الدولة، يمضي المتسوغ كمبيالة في مبلغ الثمن الجملي للشقة موضوع هذا العقد.
                        وفي حالة وفاة المتسوغ، ينتقل حق الانتفاع بهذا العقد وكل الالتزامات المضمّنة به لقرينه ما لم يتزوج من جديد، ولأبنائه بموجب عقد جديد.
                        وينتقل حق الانتفاع بهذا العقد إلى أبناء المتسوغ، في صورة وفاة القرين أو حرمانه من هذا الحق، بموجب عقد جديد.
                        وفي حالة وفاة المتسوغ ووجود أبناء قصّر، يتم البتّ في الوضعية وفقا للإجراءات القانونية المعمول بها من قبل اللجنة الجهوية لمتابعة برنامج السكن الاجتماعي بولاية تونس وبعد البت فيها يتم إبرام عقد جديد طبقا للقرار المتخذ في شأنها.


                    </p>
                </div>

                <div className="section">
                    <h2>
                        الفصل الخامس: تحويز المكرى.                    </h2>
                    <p>
                        لا يحوّز المتسوغ بالمكرى إلا بعد إرجاع النظائر الأصلية الأربع من عقد الكراء المملك إلى المسوغ ممضاة مع التعريف بالإمضاء عليها ومسجلة بالقباضة المالية، ويتم تسليم مفاتيح الشقة وجوبا على عين المكان وبعد تحرير محضر تحويز يقع إمضاؤه من الطرفين.
                        يعترف المتسوغ بالرؤية والتقليب للمكرى وقبوله على الحالة التي هو عليها حدّا وموقعا ومساحة بالثمن المذكور دون احتراز أو تحفظ.
                        يجب على المتسوغ أن يعلم المسوغ بالعيوب الظاهرة للبناء وذلك في أجل ثلاثة أشهر بداية من تاريخ التحويز.
                    </p>
                </div>

                <div className="section">
                    <h2>
                        الفصل السادس: نقل الملكية.                    </h2>
                    <p>
                        يصبح المتسوغ مالكا للشقة بعد خلاص جميع معينات الكراء الشهرية طيلة خمسة وعشرون سنة (25 سنة)
                        طبقا للفصل 2 من قرار وزير التجهيز والإسكان والتهيئة الترابية ووزير المالية مؤرخ في 31 مارس 2016. كما يمكن له أن يصبح مالكا للشقة المذكورة بعد خلاص جميع معينات الكراء الشهرية قبل انتهاء مدّة التقسيط المذكورة أعلاه أو بمجرد خلاص كامل الأقساط المتخلدة بذمته صبرة واحدة.
                        ويحجر على المتسوغ إدخال أي تغيير على الشقة المذكورة إلا بعد خلاص كامل الثمن وإبرام عقد البيع.
                        ويحجر على المتسوغ التفويت في الشقة قبل خلاص كامل الأقساط المتخلدة بذمته وانقضاء مدة عشر سنوات من تاريخ ابرام عقد الكراء المملك معه أو بعد ترخيص الوزير المكلف بالإسكان في ذلك مسبقا حسب الوضعيّة.
                        تتعهد الشركة الوطنية العقارية للبلاد التونسية باستخراج شهادة الملكية الفردية الخاصة بالشقة موضوع هذا العقد وتتولى التفويت له فيها بعد خلاصه كامل ثمن التفويت الجملي للشقة.
                        يتم نقل الملكية بمقتضى كتب بيع يبرم بين الطرفين المتعاقدين بعد خلاص كامل أقساط معينات الكراء وتحمل جميع المصاريف المترتبة عن ترسيم كتب البيع وإيداعه بإدارة الملكية العقارية على كاهل المشتري الذي يلتزم بذلك.
                    </p>
                </div>
                <div className="section">
                    <h2>
                        الفصل السابع: سقوط الحق
                    </h2>
                    <p>
                        يسقط حق المتسوغ في ملكية الشقة المذكورة عند تخلفه عن خلاص معينات كراء ثلاثة أشهر متتالية وبعد اتخاذ جميع الإجراءات القانونية اللازمة والجاري بها العمل، ويتم وضع هذه الشقة على ذمة المسوغ قصد تسويغها بنفس الصيغة لمنتفع آخر بعد إخلائها ولا يمكن للمتسوغ بعد ذلك طلب استرجاع المبالغ التي دفعها والتي تعتبر بمثابة معينات كراء الفترة التي استغل فيها الشقة.
                        يلتزم المتسوغ بأن يتم استغلال المكرى من قبله وعائلته فقط ويحجّر عليه تسويغه لفائدة الغير ويسقط حقه في ملكية الشقة المسندة له في صورة تسويغها أو التفويت فيها قبل خلاص كامل الأقساط المتخلّدة بذمته وقبل انقضاء مدة عشر سنوات من تاريخ إبرام عقد الكراء المملك.
                    </p>
                </div>
                <div className="section">
                    <h2>
                        الفصل الثامن: إلتزامات المتسوغ.                    </h2>
                    <p>
                        يتعهد المتسوغ باحترام الصبغة السكنية للمكرى ويلتزم بعدم إكسابه أية صبغة أخرى أو ممارسة نشاطات غير مصادق عليها بالمكرى المذكور كما يلتزم باحترام المثال الهندسي الخارجي للمكرى المعد من طرف المسوغة.
                        كما يلتزم المتسوغ بالقيام بصيانة المكرى وجميع الإصلاحات اللازمة للأضرار التي قد تلحق به وذلك قصد المحافظة عليه.

                    </p>
                </div>
                <div className="section">
                    <h2>
                        الفصل التاسع: الأداءات.
                    </h2>
                    <p>
                        يتحمل المتسوغ جميع الآداءات والمعاليم الموظفة على الشقة بداية من إمضائه عقد الكراء المملك، ويلتزم بخلاص المبالغ المتخلدة بذمته حتى في صورة إخراجه من الشقة لعدم خلاص معينات الكراء.                    </p>
                </div>

                <div className="section">
                    <h2>
                        الفصل العاشر: معلوم التسجيل.                                  </h2>
                    <p>
                        يتم تسجيل هذا العقد بالمعلوم القار وذلك طبقا للفصل 31 من القانون عدد 27 لسنة 2012 المؤرخ في 29 ديسمبر 2012 والمتعلق بقانون المالية لسنة 2013 باعتبار أن التفويت في هذا المسكن يندرج في إطار البرنامج الخصوصي للسكن الاجتماعي.
                        وتحمل جميع مصاريف تسجيل هذا العقد بالقباضة المالية على المتسوغ الذي يلتزم بذلك.
                    </p>
                </div>

                <div className="section">
                    <h2>
                        الفصل   الحادي عشر: فض النزاعات
                    </h2>
                    <p>
                        في صورة نزاع بين الطرفين فإن محاكم مرجع نظر ولاية نابل تكون مختصة بالنظر في النزاع.
                    </p>
                </div>

                <div className="section">
                    <h2>
                        الفصل  الثاني عشر: تعيين محل مخابرة.
                    </h2>
                    <p>
                        لتنفيذ مقتضيات هذا العقد وما ينجر عنه، اختارت المسوغة محل مخابرتها بمقرها الاجتماعي المبين بطالع هذا العقد وبالنسبة للمتسوغ فإن محل مخابرته عنوان الشقة موضوع هذا العقد.                            </p>
                </div>

                <div className="section">
                    <h2>
                        الفصل  الثالث عشر: محرر العقد .
                    </h2>
                    <p>
                        عملا بمقتضيـات الفصل 377 من مجلـة الحقـوق العينية المنقـح بالقانــون عـــدد 46 لسنـة 1992 المـؤرخ فـي 04/05/1992 والمتمــم بالقانون عدد 84 لسنة 1992 المؤرخ في 06/08/1992 وقع تحرير هذا العقد من طرف الأستاذة حنان بن عمارة المحامية لدى التعقيب والكائن مكتبها بعدد 42 شارع الشاذلي قلالة الطابق الرابع بتونس معرفها الجبائي عدد Q/A/P/000 1020432 والتي تصرح بعدم وجود أي مانع قانوني للتحرير.
                        يعتبر إمضاء الطرفين على هذا الكتب إقرارا منهما بإعلامهما بتلك الحالة القانونية من ناحية وبقبولهما بها ورضائهما بالإمضاء على هذا الكتب بعد اطلاعهما عليه من ناحية أخرى.
                    </p>
                </div>

                <div className="section">

                    <h4>
                        حرر هذا العقد في ستة نظائر
                        محرر هذا العقد
                        الأستاذة حنان بن عمارة المحامية

                    </h4>
                </div>































                <div style={{ display: 'flex', justifyContent: 'space-around', marginTop: '30px', color: 'blue', fontSize: '22px' }}>

                    <p>الشركة الوطنية العقارية للبلاد التونسية</p>
                    <p>{adjustedText.locataire}</p>
                </div>

            </div>
            <button onClick={downloadPdf}>Download PDF</button>
        </div>
    );
};

export default ContractDocument;
